Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: El segment de text the complex situations conté el mot complex que pot ser un adjectiu (adj) o un substantiu (n); entre les regles del desambiguador categorial hi ha una regla que en aquest cas assigna la categoria d'adjectiu quan va entre un determinant i un substantiu.}
es_es: El segmento de texto the complex situations contiene la palabra complex que puede ser un adjetivo (adj) o un sustantivo (n); entre las reglas del desambiguador categorial hay una regla que en este caso asigna la categoría del adjetivo cuando va entre un determinante y un sustantivo.}

source: El seu objectiu era la construcció d'un sistema de transferència multilingüe que permetera la traducció entre totes les llengües de la Comunitat Europea.
es_es: Su objetivo era la construcción de un sistema de transferencia multilingüe que permitiera la traducción entre todas las lenguas de la Comunidad Europea.

source: El sistema comercial més sofisticat dels 1980 és Metal (1988), finançat per Siemens i que tradueix de l'alemany a l'anglés.
es_es: El sistema comercial más sofisticado de los 80 es Metal (1988), financiado por Siemens y que traduce del alemán al inglés.

source: El sistema de traducció automàtica el tradueix per 0,03$ n$ i corregir-lo costa 0,10$($10$/$100$) n$, és a dir, 0,01$ n$ euros perquè només 10 de cada 100 mots són incorrectes.
es_es: El sistema de traducción automática lo traduce por 0,03$ n$ y corregirlo cuesta 0,10$($10$/$100$) n$, es decir, 0,01$ n$ euros porque sólo 10 de cada 100 palabras son incorrectas.

source: El sistema de traducció automàtica el tradueix per 0,03$$1000$=$30 euros, i corregir-lo costa 10 euros, perquè en 1000 paraules hi ha 1000$ $10$/$100$=$100 mots incorrectes i corregir cada un costa 0,10 euros: 0,10$$100$=$10.
es_es: El sistema de traducción automática lo traduce por 0,03$$1000$=$30 euros, y corregirlo cuesta 10 euros, porque en 1000 palabras hay 1000$ $10$/$100$=$100 palabras incorrectas y corregir cada una cuesta 0,10 euros: 0,10$$100$=$10.

source: El sistema és un sistema de transferència morfològica avançada estàndard, que llegeix els textos d'esquerra a dreta, mot a mot, busca en l'entrada els patrons de categories lèxiques que conté en el seu catàleg, selecciona el més llarg, reordena i concorda els mots del patró, els escriu, i continua després de la zona reordenada.
es_es: El sistema es un sistema de transferencia morfológica avanzada estándar, que lee los textos de izquierda a derecha, palabra a palabra, busca en la entrada los patrones de categorías léxicas que contiene en su catálogo, selecciona el más largo, reordena y concuerda las palabras del patrón, los escribe, y continúa después de la zona reordenada.

source: El terme computer-aided translation s'usa normalment per a referir-se a l'entorn de programari que permet la traducció professional amb el suport de bases de dades lèxiques (vegeu l'epígraf ), i dels suggeriments de traducció provinents de memòries de traducció (vegeu el capítol ), i fins i tot, de la traducció automàtica.
es_es: El término computer-aided translation se usa normalmente para referirse al entorno de software que permite la traducción profesional con el apoyo de bases de datos léxicas (véase el epígrafe ), y de las sugerencias de traducción provenientes de memorias de traducción (véase el capítulo ), e incluso, de la traducción automática.

source: El text, pràcticament inintel·ligible per a qui no sàpia basc: { Bazkaria bukatu ondoren Koldo egunkarira joan zen eta Teoren foto bat hartu zuen.
es_es: El texto, prácticamente ininteligible para quien no sepa vasco: { Bazkaria bukatu ondoren Koldo egunkarira joan zen eta Teoren foto bate hartu zuen.

source: Elegeix la seqüència que està en l'ordre temporal correcte: Preedició, postedició, traducció per transferència, disseminació.
es_es: Elige la secuencia que está en el orden temporal correcto: Preedición, postedición, traducción por transferencia, diseminación.

source: Elegeix una llengua origen (català, espanyol, anglés, francés o alemany) i una llengua meta (català, espanyol, anglés, francés o alemany) i dóna tres exemples de frases que es poden traduir acceptablement mot per mot però tals que si canviem un mot de les frases per un altre de la mateixa categoria, la traducció mot per mot resulta incorrecta.
es_es: Elige una lengua origen (catalán, español, inglés, francés o alemán) y una lengua meta (catalán, español, inglés, francés o alemán) y da tres ejemplos de frases que se pueden traducir aceptablemente palabra por palabra pero si cambiamos una palabra de las frases por otra de la misma categoría, la traducción palabra por palabra resulta incorrecta.

source: Elegiu dues llengües $L_1$ i $L_2$ i poseu almenys dos exemples de traduccions mot per mot de $L_1$ a $L_2$ amb problemes de concordança.
es_es: Elegid dos lenguas $L_1$ y $L_2$ y poned al menos dos ejemplos de traducciones palabra por palabra de $L_1$ a $L_2$ con problemas de concordancia.

source: Elegiu tres mots de $L$ que tinguen aquest problema i descrigueu com els tractaríeu en un llenguatge controlat basat en $L$.
es_es: Elegid tres palabras de $L$ que tengan este problema y describid cómo los trataríais en un lenguaje controlado basado en $L$.

source: Ell - soler menjar més-d'un home aleshores; un temps, un temps aleshores, més-d'un home anar parlar gran home en més-d'un, cap en més-d'un, més-d'un - anar parlar ell aleshores, ell - dir: ``Molt-bé, vosaltres-i-jo haver-de trobar nou illa''.} I ara, veritat que s'entén una miqueta més?
es_es: Ell - soler menjar més-d'un home aleshores; un temps, un temps aleshores, més-d'un home anar parlar gran home en més-d'un, cap en més-d'un, més-d'un - anar parlar ell aleshores, ell - dir: ``Molt-bé, vosaltres-i-jo haver-de trobar nou illa".} Y ahora, ¿verdad que se entiende un poquito más?

source: Ell va dir: ``Molt bé, hem de trobar una nova illa''.} L'ordre dels mots no és molt diferent en tok pisin i en català i això fa que la traducció mot per mot siga prou llegidora.
es_es: Ell va dir: ``Molt bé, hem de trobar una nova illa".} El orden de las palabras no es muy diferente en tok pisin y en catalán, lo que hace que la traducción palabra por palabra sea bastante legible.

source: Els generadors morfològics es poden organitzar de forma molt similar: lligen símbol a símbol la forma lèxica i produeixen la forma superficial.
es_es: Los generadores morfológicos se pueden organizar de forma muy similar: leen símbolo por símbolo la forma léxica y producen la forma superficial.

source: Els altres vèrtexs representen l'estat de l'analitzador després d'haver llegit una o més lletres.
es_es: Los otros vértices representan el estado del analizador después de haber leído una o más letras.

source: Els analitzadors GLR lligen les categories lèxiques d'esquerra a dreta, les desplacen a un tipus de memòria especial anomenat pila (és a dir, les hi empilen) i quan el cim de la pila conté elements que segons la gramàtica i el context immediat posterior es poden agrupar en un subarbre, els desempila, els redueix a un subarbre, i deixa el subarbre en el cim de la pila.
es_es: Los analizadores GLR leen las categorías léxicas de izquierda a derecha, las desplazan a un tipo de memoria especial denominada pila (es decir, se las apilan) y cuando la cumbre de la pila contiene elementos que según la gramática y el contexto inmediato posterior se pueden agrupar en un subárbol, los desapila, los reduce a un subárbol, y deja el subárbol en la cumbre de la pila.

source: Els canvis estilístics s'han de fer estrictament quan, si no es feren, la traducció resultant no compliria amb el propòsit per al qual va ser encarregada.
es_es: Los cambios estilísticos se tienen que hacer estrictamente cuando, si no se hicieron, la traducción resultante no cumpliría con el propósito para el cual fue encargada.

source: Els conceptes d'aquesta secció estan presos quasi íntegrament d'aquesta obra.
es_es: Los conceptos de esta sección se han extraído casi íntegramente de esta obra.

source: Els desavantatges d'interlingua s'atenuarien si en comptes d'una representació interlingual semàntica (basada en nocions com ara agent, pacient, destinatari, temps, etc.) fóra més aviat de naturalesa lèxica.
es_es: Los inconvenientes de interlingua se atenuarían si en vez de una representación interlingual semántica (basada en nociones como por ejemplo agente, paciente, destinatario, tiempo, etc.) fuera más bien de naturaleza léxica.

source: Els estats finals (representats amb dos cercles concèntrics) indiquen estats en els quals l'analitzador determina que ha llegit una forma superficial completa si no queden més lletres a llegir; en alguns estats finals s'escriuen símbols addicionals per a completar l'anàlisi i, en el cas d'un homògraf (ambigüitat lèxica), totes les opcions.
es_es: Los estados finales (representados con dos círculos concéntricos) indican estados en los cuales el analizador determina que ha leído una forma superficial completa si no quedan más letras por leer; en algunos estados finales se escriben símbolos adicionales para completar el análisis y, en el caso de una homografía (ambigüedad léxica), todas las opciones.

source: Els exercicis marcats amb (*) són més difícils.
es_es: Los ejercicios marcados con (*) son más difíciles.

source: Els experts que hi treballaran han de saber traduir entre la llengua $L_7$ i les altres sis.
es_es: Los expertos que trabajarán con ese sistema tienen que saber traducir entre la lengua $L_7$ y las otras seis.

source: Els informàtics del projecte us demanen consell sobre les regles de reordenament del sistema, ja que, per motius tècnics, només poden afegir-n'hi tres.
es_es: Los informáticos del proyecto os piden consejo sobre las reglas de reordenamiento del sistema, puesto que, por motivos técnicos, sólo pueden añadir tres.

source: Els informàtics que participen en el disseny d'un sistema de traducció per interlingua t'informen que cada una de les fases del sistema s'ha d'executar en un ordinador diferent.
es_es: Los informáticos que participan en el diseño de un sistema de traducción por interlingua te informan de que cada una de las fases del sistema se tiene que ejecutar en un ordenador diferente.

source: Els mots no són tots igualment freqüents en els textos.
es_es: Las palabras no son todas igualmente frecuentes en los textos.

source: Els mètodes basats en corpus es poden dividir en dos grups: estadístics i basats en exemples.
es_es: Los métodos basados en corpus se pueden dividir en dos grupos: estadísticos y basados en ejemplos.

source: Els mètodes basats en exemples (vegeu el capítol ) s'aprofiten també de l'existència de grans corpora de textos traduïts (per això també s'en diu basats en memòria).
es_es: Los métodos basados en ejemplos (véase el capítulo ) se aprovechan también de la existencia de grandes corpora de textos traducidos (por eso también se dice basados en memoria).

source: Els mètodes estadístics ja van ser considerats als anys seixanta, però prompte van ser descartats perquè els resultats obtinguts no eren acceptables.
es_es: Los métodos estadísticos ya fueron considerados en los años sesenta, pero pronto fueron descartados porque los resultados obtenidos no eran aceptables.

source: Els paràgrafs següents en donen alguns exemples.
es_es: Los párrafos siguientes dan algunos ejemplos.

source: Els plurals dels noms es fan amb -s o -es.
es_es: Los plurales de los nombres se hacen con -s o -es.

source: Els principals corrents dins la TA des dels 70 són, per tant: eines de suport a la traducció per a traductors, sistemes de TA amb intervenció humana i recerca teòrica vers un sistema completament automàtic de traducció.
es_es: Las principales corrientes dentro de la TA desde los años 70 son, por lo tanto: herramientas de apoyo a la traducción para traductores, sistemas de TA con intervención humana e investigación teórica a través de un sistema de traducción completamente automático.

source: Els principals models estadístics que s'usen per puntuar les hipòtesis de traducció són el model de traducció i el model de llengua, els quals s'expliquen més avall.
es_es: Los principales modelos estadísticos que se usan para puntuar las hipótesis de traducción son el modelo de traducción y el modelo de lengua, los cuales se explican más abajo.

source: Els projectes més notables són GETA-Ariane (Grenoble), SUSY (Saarbrücken), Mu (Kyoto), DLT (Utrecht), Rosetta (Eindhoven), el projecte de la Universitat Carnegie-Mellon (Pittsburgh) i dos projectes internacionals: Eurotra, finançat per la Comunitat Europea i el projecte japonés CICC amb participants a la Xina, Indonèsia i Tailàndia.
es_es: Los proyectos más notables son GETA-Ariane (Grenoble), SUSY (Saarbrücken), Mu (Kyoto), DLT (Utrecht), Rosetta (Eindhoven), el proyecto de la Universidad Carnegie-Mellon (Pittsburgh) y dos proyectos internacionales: Eurotra, financiado por la Comunitad Europea y el proyecto japonés CICC con participantes en China, Indonesia y Tailandia.

source: Els recursos de maquinari, programari i llenguatges de programació eren massa reduïts i la primera aproximació va ser la traducció mot per mot basada en diccionari amb algunes regles senzilles de reordenament (de vegades erròniament anomenada traducció directa, i similar als sistemes de traducció indirecta per transferència morfològica avançada, vegeu l'apartat ).
es_es: Los recursos de hardware, software y lenguajes de programación eran demasiado reducidos y la primera aproximación fue la traducción palabra por palabra basada en diccionario con algunas reglas sencillas de reordenamiento (a veces erróneamente llamada traducción directa y similar a los sistemas de traducción indirecta por transferencia morfológica avanzada, véase el apartado ).

source: Els següents exemples estan presos per al parell espanyol--català; en cada cas, la primera frase és un exemple de traducció correcta i el segon d'incorrecta: [Homografia:] Le traje un [sombrero] $$ Li vaig portar un [barret]; Le traje un [traje] $$ Li vaig portar un [vaig portar]$^*$ (correcte: vestit).
es_es: Los siguientes ejemplos están tomados para el par español--catalán; en cada caso, la primera frase es un ejemplo de traducción correcta y el segundo de incorrecta: [Homografía:] Le traje un [sombrero] $$ Li vaig portar un [barret]; Le traje un [traje] $$ Li vaig portar un [vaig portar]$^*$ (correcto: vestit).

source: Els sistemes anomenats d'interlingua apareixen en el cas extrem en què l'anàlisi de la frase d'origen és tan profunda que la traducció es pot generar directament a partir d'aquesta sense fer-hi transferència (vegeu la fig. ).
es_es: Los sistemas denominados de interlingua aparecen en el caso extremo en el que el análisis de la frase de origen es tan profundo que la traducción se puede generar directamente a partir de ésta sin hacer transferencia (véase la fig. ).

source: Els sistemes clàssics usen representacions estructurals més o menys complexes per a representar les relacions semàntiques entre els elements de la frase.
es_es: Los sistemas clásicos usan representaciones estructurales más o menos complejas para representar las relaciones semánticas entre los elementos de la frase.

source: Els sistemes de transferència sintàctica (vegeu l'apartat ) prenen una drecera i van directament de l'arbre d'anàlisi sintàctica i els mots en LO a l'arbre i els mots en LM.
es_es: Los sistemas de transferencia sintáctica (véase el apartado ) toman un atajo y van directamente del árbol de análisis sintáctico y las palabras en LO al árbol y las palabras en LM.

source: Els sistemes de traducció automàtica reals, és a dir, els que s'usen en la realitat, són el resultat de fer una series d'aproximacions sobre la traducció automàtica ideal per fer el problema de la traducció computacionalment abordable.
es_es: Los sistemas de traducción automática reales, es decir, los que se usan en la realidad, son el resultado de hacer una serie de aproximaciones sobre la traducción automática ideal para hacer el problema de la traducción computacionalmente abordable.

source: Els sistemes de traducció automàtica basats en la transferència sintàctica (és a dir, en l'aproximació que diu que es poden transformar d'una banda les estructures sintàctiques ---transferència estructural--- i d'altra banda substituir el lèxic ---transferència lèxica--- fent ambdues operacions independentment) solen funcionar bé en casos senzills, però en general es fa necessària una anàlisi més profunda {hovy93j}, ja que la correspondència entre les relacions sintàctiques (subjecte, objecte directe, objecte indirecte, etc.) i les relacions semàntiques (agent, pacient, destinatari etc.) dels constituents d'una frase poden variar d'una llengua a una altra.
es_es: Los sistemas de traducción automática basados en la transferencia sintáctica (es decir, en la aproximación que dice que se pueden, por un lado, transformar las estructuras sintácticas---transferencia estructural--- y, por otro lado, sustituir el léxico---transferencia léxica--- haciendo ambas operaciones independientemente) suelen funcionar bien en casos sencillos, pero en general se hace necesario un análisis más profundo {hovy93j}, puesto que la correspondencia entre las relaciones sintácticas (sujeto, complemento directo, complemento indirecto, etc.) y las relaciones semánticas (agente, paciente,destinatario etc.) de los constituyentes de una frase pueden variar de una lengua a otra.

source: Els sistemes de traducció automàtica estadística aprenen a traduir a partir de diccionaris bilingües fets a mà i de textos monolingües en la llengua meta.
es_es: Los sistemas de traducción automática estadística aprenden a traducir a partir de diccionarios bilingües hechos a mano y de textos monolingües en la lengua meta.

source: Els sistemes de traducció mot per mot poden cometre, per exemple, errors en la concordança de gènere o de nombre.
es_es: Los sistemas de traducción palabra por palabra pueden cometer, por ejemplo, errores en la concordancia de género o de número.

source: Els sistemes de transferència es classifiquen segons la naturalesa de les representacions abstractes que utilitzen: es pot parlar, en ordre de profunditat de l'anàlisi, de sistemes de transferència morfològica, de transferència sintàctica o de { transferència semàntica}.
es_es: Los sistemas de transferencia se clasifican según la naturaleza de las representaciones abstractas que utilizan: se puede hablar, en orden de profundidad del análisis, de sistemas de transferencia morfológica, de transferencia sintáctica o de { transferencia semántica}.

source: Els sistemes de transferència morfològica no poden tenir en compte aquesta estructura interna, i, com a resultat, necessiten moltíssimes regles per a reordenar adequadament els mots de les frases.
es_es: Los sistemas de transferencia morfológica no pueden tener en cuenta esta estructura interna y, como resultado, necesitan muchísimas reglas para reordenar adecuadamente las palabras de las frases.

source: Els sistemes de transferència morfològica per reordenament de patrons assumeixen que una oració és una seqüència lineal de sintagmes d'estructura lineal; aquest model de la sintaxi d'una oració pot ser molt limitat en moltes aplicacions de traducció automàtica.
es_es: Los sistemas de transferencia morfológica por reordenamiento de patrones asumen que una oración es una secuencia lineal de sintagmas de estructura lineal; este modelo de la sintaxis de una oración puede ser muy limitado en muchas aplicaciones de traducción automática.

source: Els sistemes de transferència semàntica construeixen representacions intermèdies més profundes; l'anàlisi i la generació són més complexes, però la transferència se simplifica.
es_es: Los sistemas de transferencia semántica construyen representaciones intermedias más profundas; el análisis y la generación son más complejos, pero la transferencia se simplifica.

source: Els textos del corpus d'aprenentatge poden a més ser anotats o processats amb algun tipus de processador lingüístic com ara un analitzador morfològic o sintàctic.
es_es: Los textos del corpus de aprendizaje pueden, además, ser anotados o procesados con algún tipo de procesador lingüístico como un analizador morfológico o sintáctico.

source: Els traductors es van sentir amenaçats.
es_es: Los traductores se sintieron amenazados.

source: Els treballs a IBM van utilitzar el corpus de textos en anglés i francés resultants de les sessions del Parlament de Canadà.
es_es: Los trabajos en IBM utilizaron el corpus de textos en inglés y francés resultantes de las sesiones del Parlamento de Canadá.

source: Els usos civils de l'screening han superat actualment l'ús tradicional, el militar.
es_es: Los usos civiles del screening han superado actualmente el uso tradicional, el militar.

source: Els usuaris d'aquest tipus de sistemes es podrien classificar en tres grans grups: traductors ocasionals, traductors professionals individuals i traductors professionals que treballen per a empreses de traducció.
es_es: Los usuarios de este tipo de sistemas se podrían clasificar en tres grandes grupos: traductores ocasionales, traductores profesionales individuales y traductores profesionales que trabajan para empresas de traducción.

source: Els vaig veure caure. ja que això requereix l'ús de quantitats enormes de coneixement enciclopèdic sobre el funcionament del ``món real''.
es_es: Los vi caer. puesto que esto requiere el uso de cantidades enormes de conocimiento enciclopédico sobre el funcionamiento del ``mundo real''.

source: En altre cas, cal sempre mirar mai el text original.
es_es: En otro caso, es necesario mirar siempre el texto original.

source: En aquest cas, el sistema ha de saber: que els trets fereixen greument o maten les persones que els reben i que la condició de ferit greu o mort és incompatible amb mantenir-se dret, i que, per tot això, la interpretació més probable és que van caure els xiquets, no els soldats.
es_es: En este caso, el sistema tiene que saber: que los disparos hieren gravemente o matan a las personas que los reciben y que la condición de herido grave o muerto es incompatible con mantenerse derecho, y que, por todo esto, la interpretación más probable es que cayeron los niños, no los soldados.

source: En aquest exemple el corpus consta de tres oracions paral·leles en dos llengües inventades.
es_es: En este ejemplo el corpus consta de tres oraciones paralelas en dos lenguas inventadas.

source: En aquest sentit, els sistemes de transferència semàntica i d'interlingua proven de construir una representació semàntica a partir de l'arbre i de la semàntica dels mots, de manera que fan una interpretació més general del principi.
es_es: En este sentido, los sistemas de transferencia semántica y de interlingua intentan construir una representación semántica a partir del árbol y de la semántica de las palabras, de forma que hacen una interpretación más general del principio.

source: En aquests anys es consolida la idea que els sistemes de TA no són per a traductors; un traductor necessita eines que li faciliten el treball: diccionaris, bases de dades terminològiques (vegeu el capítol ), sistemes de comunicació, memòries de traducció (vegeu el capítol ), etc.
es_es: En estos años se consolida la idea de que los sistemas de TA no son para traductores; un traductor necesita herramientas que le faciliten el trabajo: diccionarios, bases de datos terminológicas (véase el capítulo ), sistemas de comunicación, memorias de traducción (véase el capítulo ), etc.
